app/views/api/v1/interests_constellations/_info.json.jbuilder

json.user_id                interests_constellation.user_id
json.created_at             interests_constellation.created_at
---
INSERT INTO "interests_constellations" ("constellation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["constellation_id", 2], ["user_id", 1], ["created_at", "2019-05-15 04:00:36.314958"], ["updated_at", "2019-05-15 04:00:36.314958"]]