app/views/api/v1/planets/_info.json.jbuilder

json.constellation_id           planet.constellation_id
json.created_at                 planet.created_at
---
INSERT INTO "planets" ("title", "constellation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title5_planet"], ["constellation_id", 5], ["created_at", "2019-05-15 05:19:55.311558"], ["updated_at", "2019-05-15 05:19:55.311558"]]