app/controllers/api/v1/constellations_controller.rb

      def index
        query = Constellation.order(:id)
        query = query.page(params[:page]) if params[:page].present?
        query = params[:is_deleted].present? ? query.is_deleted(params[:is_deleted]): query.is_deleted(false)
        query = query.show_on_sign_up(params[:show_on_sign_up]) if params[:show_on_sign_up].present?
---
SELECT  "constellations".* FROM "constellations" ORDER BY "constellations"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 24], ["OFFSET", 0]]
SELECT  "constellations".* FROM "constellations" WHERE "constellations"."is_deleted" = $1 ORDER BY "constellations"."id" ASC LIMIT $2 OFFSET $3  [["is_deleted", "true"], ["LIMIT", 24], ["OFFSET", 0]]
SELECT  "constellations".* FROM "constellations" WHERE "constellations"."show_on_sign_up" = $1 AND "constellations"."is_deleted" = $2 ORDER BY "constellations"."id" ASC LIMIT $3 OFFSET $4  [["show_on_sign_up", "false"], ["is_deleted", "false"], ["LIMIT", 24], ["OFFSET", 0]]

      def search
          @constellations = Constellation.search(params[:constellation]).page(params[:page])
---
SELECT  "constellations".* FROM "constellations" WHERE (LOWER(name) like LOWER('%bullying%')) ORDER BY "constellations"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]