app/controllers/api/v1/interests_constellations_controller.rb

INSERT INTO "interests_constellations" ("constellation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["constellation_id", 2], ["user_id", 1], ["created_at", "2019-05-10 09:18:37.439805"], ["updated_at", "2019-05-10 09:18:37.439805"]]
---
      def create
        @interests_constellation = InterestsConstellation.create!(interests_constellation_params)

SELECT "interests_constellations".* FROM "interests_constellations"
---
      def index
        @interests_constellations = InterestsConstellation.all

UPDATE "interests_constellations" SET "constellation_id" = $1, "updated_at" = $2 WHERE "interests_constellations"."id" = $3  [["constellation_id", 4], ["updated_at", "2019-05-10 09:27:12.534996"], ["id", 2]]
---
      def update
        interests_constellation.update!(interests_constellation_params)

DELETE FROM "interests_constellations" WHERE "interests_constellations"."id" = $1  [["id", 1]]
---
      def destroy
        interests_constellation.destroy