app/controllers/api/v1/interests_constellations_controller.rb

SELECT  "interests_constellations".* FROM "interests_constellations" LIMIT $1  [["LIMIT", 11]]
---
      def index
        @interests_constellations = InterestsConstellation.all.page(params['page'])