app/controllers/api/v1/interests_planets_controller.rb

INSERT INTO "interests_planets" ("planet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["planet_id", 1], ["user_id", 1], ["created_at", "2019-05-10 09:52:56.021434"], ["updated_at", "2019-05-10 09:52:56.021434"]]
---
      def create
        @interests_planet = InterestsPlanet.create!(interests_planet_params)

SELECT "interests_planets".* FROM "interests_planets"
---
      def index
        @interests_planets = InterestsPlanet.all

UPDATE "interests_planets" SET "planet_id" = $1, "user_id" = $2, "updated_at" = $3 WHERE "interests_planets"."id" = $4  [["planet_id", 22], ["user_id", 12], ["updated_at", "2019-05-15 05:10:24.938919"], ["id", 2]]
---
      def update
        interests_planet.update!(interests_planet_params)

DELETE FROM "interests_planets" WHERE "interests_planets"."id" = $1  [["id", 1]]
---
      def destroy
        interests_planet.destroy