app/controllers/api/v1/planets_controller.rb

SELECT "planets".* FROM "planets" WHERE "planets"."is_deleted" = $1 AND "planets"."is_approved" = $2 ORDER BY "planets"."id" ASC  [["is_deleted", "false"], ["is_approved", "false"]]
SELECT "planets".* FROM "planets" WHERE "planets"."is_approved" = $1 AND "planets"."is_deleted" = $2 AND "planets"."constellation_id" IN (1, 2, 3) ORDER BY "planets"."id" ASC  [["is_approved", "t"], ["is_deleted", "f"]]
---
      def index
        if params[:is_deleted].present? && params[:is_approved].present?
          @planets = Planet.where({:is_deleted => params[:is_deleted], :is_approved => params[:is_approved]})
          json_response({ planets: @planets })
        elsif query_params.present?
          @planets = Planet.where(:constellation_id => query_params)

INSERT INTO "planets" ("title", "constellation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title1_planet"], ["constellation_id", 4], ["created_at", "2019-05-10 03:44:29.069997"], ["updated_at", "2019-05-10 03:44:29.069997"]]
---
      def create
        @planet = Planet.create!(planet_params)

UPDATE "planets" SET "title" = $1, "constellation_id" = $2, "updated_at" = $3 WHERE "planets"."id" = $4  [["title", "title33_planet"], ["constellation_id", 2], ["updated_at", "2019-05-10 04:16:27.094099"], ["id", 1]]
---
      def update
        planet.update!(planet_params)