app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "test1@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_user
        @user, params_type = if params[:email]
          [User.where(uid: params[:email]).first, 'email']
        elsif params[:user_id]
          [User.find_by_id(params[:user_id]), 'user_id']