app/views/api/v1/interests_planets/_info.json.jbuilder

json.user_id                interests_planet.user_id
json.created_at             interests_planet.created_at
---
INSERT INTO "interests_planets" ("planet_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["planet_id", 2], ["user_id", 1], ["created_at", "2019-05-15 05:09:46.663411"], ["updated_at", "2019-05-15 05:09:46.663411"]]